In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('dataset/Data.csv')

In [3]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
from sklearn.impute import SimpleImputer
imp = SimpleImputer(missing_values=np.nan, strategy='mean')

In [5]:
X= df.iloc[:,:-1].values
Y= df.iloc[:,3].values

In [6]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [7]:
Y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [8]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [9]:
X[:,1:3] = imp.fit_transform(X[:,1:3])

In [10]:
X[:,1:3]=X[:,1:3].astype(int)
X

array([['France', 44, 72000],
       ['Spain', 27, 48000],
       ['Germany', 30, 54000],
       ['Spain', 38, 61000],
       ['Germany', 40, 63777],
       ['France', 35, 58000],
       ['Spain', 38, 52000],
       ['France', 48, 79000],
       ['Germany', 50, 83000],
       ['France', 37, 67000]], dtype=object)

look age going from 27 to 50
salary going from 48000 to 83000

so both features dont have on same scale , this will cause some issue 
for machine learning model

In [13]:
#Encoding categorical data 
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

#Country column 
ct = ColumnTransformer([("Country", OneHotEncoder(), [0])],
                       remainder = "passthrough")
X = ct.fit_transform(X)
X

array([[1.0, 0.0, 0.0, 44, 72000],
       [0.0, 0.0, 1.0, 27, 48000],
       [0.0, 1.0, 0.0, 30, 54000],
       [0.0, 0.0, 1.0, 38, 61000],
       [0.0, 1.0, 0.0, 40, 63777],
       [1.0, 0.0, 0.0, 35, 58000],
       [0.0, 0.0, 1.0, 38, 52000],
       [1.0, 0.0, 0.0, 48, 79000],
       [0.0, 1.0, 0.0, 50, 83000],
       [1.0, 0.0, 0.0, 37, 67000]], dtype=object)

In [14]:
df= pd.DataFrame(X,columns=['France','Germany','Spain','Age','Salary'])
df

  France Germany Spain Age Salary
0    1.0     0.0   0.0  44  72000
1    0.0     0.0   1.0  27  48000
2    0.0     1.0   0.0  30  54000
3    0.0     0.0   1.0  38  61000
4    0.0     1.0   0.0  40  63777
5    1.0     0.0   0.0  35  58000
6    0.0     0.0   1.0  38  52000
7    1.0     0.0   0.0  48  79000
8    0.0     1.0   0.0  50  83000
9    1.0     0.0   0.0  37  67000

In [17]:
label_Y = LabelEncoder()
Y = label_Y.fit_transform(Y)

In [18]:
Y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])